---
type: IFCGuidKey
namespace: Autodesk.Revit.DB.IFC
version: 2024
members: 6
tags: [revit-api, class]
---

# IFCGuidKey

`Autodesk.Revit.DB.IFC.IFCGuidKey` · Revit 2024 · 6 members

| Kind | Member | Since | Signature |
| --- | --- | --- | --- |
| Constructor | IFCGuidKey | — | `` |
| Method | Dispose | — | `public void Dispose ()` |
| Method | Equals | 2024 | `public override bool Equals ( Object other )` |
| Method | GetHashCode | 2024 | `public override int GetHashCode ()` |
| Property | IFCGlobalId | 2024 | `public string IFCGlobalId { get ; }` |
| Property | IsValidObject | 2014 | `public bool IsValidObject { get ; }` |